'''
Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:



Попросіть користувача ввести свсвій вік (можно використати константу або input()).

- якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"

- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"

- якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

- якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"

- у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"



P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача містить цифру 7 то має бути виведено тільки відповідне повідомлення! Також подумайте над варіантами, коли введені невірні дані.


'''


print('Касир в кінотеватрі')
age = (input('Скільки вам років?'))
if age.isdigit():
    int(age)
    if int(age) < 7 and int(age)>0:
     print('Де твої батьки?')
if age.isdigit():
    int(age)
    if int(age) < 16 and int(age) > 7:
     print('Це фільм для дорослих!')
if age.startswith('7') or age.endswith('7'):
    int(age)
    if int(age)>0:
     print('Вам сьогодні пощастить!')
if age.isdigit():
    int(age)
    if int(age) > 65 and int(age)%10 !=7 and int(age)!=70:
     print("Покажіть пенсійне посвідчення!")
if age.isalpha():
    print('Error')
if age.startswith('-'):
    int(age)
    if int(age) <= 0:
     print('You entered wrong information!')
else:
    print('А білетів вже немає!')
